app/views/lab_users/_form.html.erb

SELECT `lab_roles`.* FROM `lab_roles`
---
    <div class="controls">
      <%=f.select :role_id, options_from_collection_for_select(LabRole.all,'id','name',''),:include_blank=>"请选择" %>