app/views/lab_eval_projects/apply.html.erb

SELECT `options`.* FROM `options` WHERE `options`.`key` = 'eval_object_type' AND `options`.`value` = 2 LIMIT 1
---
        <td><%= lab_eval_project.version %></td>
        <td><%= Option.where(:key=>"eval_object_type",:value=>lab_eval_project.category_id).first.name if lab_eval_project.category_id%></td>