app/views/lab_eval_projects/index.html.erb

        <td><%= lab_eval_project.version %></td>
        <td><%= Option.where(:key=>"eval_object_type",:value=>lab_eval_project.category_id).first.name if lab_eval_project.category_id %></td>
---
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'eval_object_type' AND `options`.`value` = 1 LIMIT 1