app/views/lab_teach_designs/index.html.erb

        <td><%= lab_teach_design.lab_user.name %></td>
        <td><%= Option.where(:key=>"course_type",:value=>lab_teach_design.course_type).first.name %></td>
---
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'course_type' AND `options`.`value` = 2 LIMIT 1