app/views/lab_notices/index.html.erb

        <td><%#= LabCat.find(lab_notice.cat_id).cat_name %></td>
        <td><%= Option.where(:key=>"notice_type",:value=>lab_notice.notice_type).first.name %></td>
---
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'notice_type' AND `options`.`value` = 1 LIMIT 1