app/views/lab_teach_resources/_form.html.erb

      <div class="controls">
        <%=f.select :course_type, options_from_collection_for_select(Option.where(:key=>"course_type"),'value','name',@lab_teach_resource.course_type),:include_blank=>"请选择" %>
---
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'course_type'