app/views/lab_teach_resources/index.html.erb

        <td><%= lab_teach_resource.lab_user.name %></td>
        <td><%= Option.where(:key=>"course_type",:value=>lab_teach_resource.course_type).first.name %></td>
---
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'course_type' AND `options`.`value` = 1 LIMIT 1