app/controllers/lab_roles_controller.rb

  def index
    @lab_roles = LabRole.all
---
SELECT `lab_roles`.* FROM `lab_roles`

  def edit
    @lab_role = LabRole.find(params[:id])
---
SELECT `lab_roles`.* FROM `lab_roles` WHERE `lab_roles`.`id` = 1 LIMIT 1