app/controllers/lab_notices_controller.rb

  def index
    @lab_notices = LabNotice.all
---
SELECT `lab_notices`.* FROM `lab_notices`