app/controllers/lab_teach_designs_controller.rb

SELECT `lab_teach_designs`.* FROM `lab_teach_designs`
---
  def index
    @lab_teach_designs = LabTeachDesign.all