app/controllers/lab_mobile_courses_controller.rb

  def index
    @lab_mobile_courses = LabMobileCourse.all
---
SELECT `lab_mobile_courses`.* FROM `lab_mobile_courses`