app/controllers/lab_eval_projects_controller.rb

SELECT `lab_eval_projects`.* FROM `lab_eval_projects` WHERE `lab_eval_projects`.`applicant_id` = 2
---
  def apply
    @action='/lab_eval_projects/0/search'
    if @user.role_id==4 || @user.role_id==6 #实验室管理员或系统管理员
      @lab_eval_projects = LabEvalProject.where("status=1")
    else
      @lab_eval_projects = LabEvalProject.where(:applicant_id=>@user.id)

SELECT `lab_eval_projects`.* FROM `lab_eval_projects` WHERE (status>1)
---
  def index
    @action='/lab_eval_projects/0/search'
    @lab_eval_projects = LabEvalProject.paginate(:page => params[:page], :per_page => 5).order("created_at DESC")

    if @user.role_id==4 || @user.role_id==6 #实验室管理员或系统管理员
      @lab_eval_projects = @lab_eval_projects.where("status>1") #审批通过的项目进入评测