app/controllers/lab_teach_resources_controller.rb

  def show
    @lab_teach_resource = LabTeachResource.find(params[:id])
---
SELECT `lab_teach_resources`.* FROM `lab_teach_resources` WHERE `lab_teach_resources`.`id` = 1 LIMIT 1

  def edit
    @lab_teach_resource = LabTeachResource.find(params[:id])
---
SELECT `lab_teach_resources`.* FROM `lab_teach_resources` WHERE `lab_teach_resources`.`id` = 1 LIMIT 1

  def create
    uploaded_io = params[:file]
    if !uploaded_io.blank?
      extension = uploaded_io.original_filename.split('.')
      filename = "#{Time.now.strftime('%Y%m%d%H%M%S')}.#{extension[-1]}"
      filepath = "#{PIC_PATH}/teachResources/#{filename}"
      File.open(filepath, 'wb') do |file|
        file.write(uploaded_io.read)
      end
      params[:lab_teach_resource].merge!(:file=>"/teachResources/#{filename}")
    end
    params[:lab_teach_resource].merge!(:author_id=>@user.id)
    params[:lab_teach_resource].merge!(:status=>'0')
    @lab_teach_resource = LabTeachResource.new(params[:lab_teach_resource])

    respond_to do |format|
      if @lab_teach_resource.save
---
INSERT INTO `lab_teach_resources` (`author_id`, `brief`, `course_type`, `created_at`, `file`, `status`, `title`, `updated_at`) VALUES (2, '教学资源1教学资源1', 1, '2014-04-03 15:22:29', 'abcdefg.zip', 0, '教学资源1', '2014-04-03 15:22:29')

  def update
    uploaded_io = params[:file]
    if !uploaded_io.blank?
      extension=uploaded_io.original_filename.split('.')
      filename= "#{Time.now.strftime('%Y%m%d%H%M%S')}.#{extension[-1]}"
      File.open(Rails.root.join('public', 'upload','teachResources',filename), 'wb') do |file|
        file.write(uploaded_io.read)
      end
      params[:lab_teach_resource].merge!(:file=>"/upload/teachResourcs/#{filename}")
    end
    @lab_teach_resource = LabTeachResource.find(params[:id])

    respond_to do |format|
      if @lab_teach_resource.update_attributes(params[:lab_teach_resource])
---
SELECT `lab_teach_resources`.* FROM `lab_teach_resources` WHERE `lab_teach_resources`.`id` = 1 LIMIT 1
UPDATE `lab_teach_resources` SET `brief` = '教学资源1教学资源111111', `updated_at` = '2014-04-03 15:47:55' WHERE `lab_teach_resources`.`id` = 1