app/controllers/lab_users_controller.rb

SELECT COUNT(*) FROM `lab_users`
SELECT `lab_users`.* FROM `lab_users` ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @action='/lab_users/0/search'
    @lab_users = LabUser.paginate(:page => params[:page], :per_page => 5).order("created_at DESC")

SELECT `lab_notices`.* FROM `lab_notices` WHERE `lab_notices`.`notice_type` = 1 AND `lab_notices`.`published` = 1 ORDER BY published_at DESC LIMIT 5 OFFSET 0
SELECT `lab_eval_projects`.* FROM `lab_eval_projects` WHERE `lab_eval_projects`.`status` = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def home
    @articles = LabNotice.where(:notice_type=>1,:published=>1).paginate(:page => params[:page], :per_page => 5).order("published_at DESC")
    @projects = LabEvalProject.where(:status=>1).paginate(:page => params[:page], :per_page => 5).order("created_at DESC")

SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`id` = 1 LIMIT 1
---
  def show
    @lab_user = LabUser.find(params[:id])

SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`id` = 1 LIMIT 1
---
  def edit
    @lab_user = LabUser.find(params[:id])

INSERT INTO `lab_users` (`account`, `created_at`, `email`, `mobile`, `name`, `password`, `role_id`, `status`, `updated_at`) VALUES ('ss3', '2014-03-21 15:24:10', 'dsfd@df.com', '15888801551', 's1', '123456', 5, 0, '2014-03-21 15:24:10')
---
  def create
    @lab_user = LabUser.new(params[:lab_user])

    @lab_user.secret_key = Base64.encode64 params[:lab_user][:password]

    @lab_user.password = Digest::MD5.hexdigest(params[:lab_user][:password])

    @check_user = EdxUser.find_by_email(params[:lab_user][:email])

    LabUser.transaction do
      respond_to do |format|
        if @lab_user.save && @check_user.blank?

SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`id` = 6 LIMIT 1
---
  def update
    @lab_user = LabUser.find(params[:id])

SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`account` = 'teacher@iotps.com' LIMIT 1
---
  def login_in
    if params[:lab_user][:account].blank?

SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`id` = 6 LIMIT 1
DELETE FROM `lab_users` WHERE `lab_users`.`id` = 9
---
  def destroy
    @lab_user = LabUser.find(params[:id])
    @lab_user.destroy