app/controllers/lab_scenes_controller.rb

SELECT `lab_scenes`.* FROM `lab_scenes`
---
  def index
    @lab_scenes = LabScene.all