app/controllers/options_controller.rb

  def index
    if params[:key].blank?
      @options = Option.all
    else
      @options = Option.where(:key=>params[:key])
---
SELECT `options`.* FROM `options`
SELECT `options`.* FROM `options` WHERE `options`.`key` = 'course_type'