app/views/lab_courses/_form.html.erb

      <div class="controls">
        <%=f.select :teacher_id, options_from_collection_for_select(LabUser.where(:role_id=>"2"),'id','name',@lab_course.teacher_id),:include_blank=>"请选择" %>
---
SELECT `lab_users`.* FROM `lab_users` WHERE `lab_users`.`id` = 2 LIMIT 1