app/views/lab_mobile_courses/index.html.erb

SELECT `options`.* FROM `options` WHERE `options`.`key` = 'course_type' AND `options`.`value` = 2 LIMIT 1
---
        <td><%= lab_mobile_course.lab_user.name %></td>
        <td><%= Option.where(:key=>"course_type",:value=>lab_mobile_course.course_type).first.name %></td>